revenue_word_list_gaap = ['매출액', '영업수익', '수익(매출액)', '매출 및 지분법 손익', '매출', '매출액(매출액)', 'I.  매출액', '수익(순매출액)', '수익', '영업수익(매출액)', 'Ⅰ. 매출액', 'I.매출액', '매출및지분법손익', '매출 및 지분법손익', 'I. 매출액', '매출및 지분법손익']
operating_income_word_list_gaap = ['영업이익', '영업이익(손실)', '영업이익 (손실)', '영업손익', 'V. 영업이익', 'Ⅳ. 영업이익(손실)', 'V.영업이익', '영업손실', 'Ⅴ. 영업이익(손실)']
profit_loss_word_list_gaap = ['반기순이익', '당기순이익(손실)', '반기순이익(손실)', '당기순이익', '분(반)기순이익(손실)', '당기순손익', '분기순손익', '분기순이익', '-당기순이익(손실)', '반기순손실', '분기순이익(손실)', '총포괄순이익(손실)', '3분기순이익(손실)', '분기순손실', '연결분기순이익(손실)', '3분기순이익', '1분기순이익(손실)', '당기순손실', '순이익(손실)', '연결당기순이익(손실)', '당(분)기순이익(손실)', '법인세 차감 후 반기순이익(손실)', '3분기 순이익', '당1분기순이익', '연결 당기순이익', '당(반)기순이익(손실)', '당(반)기순이익', '당반기순이익', 'IX.당기순이익(손실)', 'Ⅰ.당기순이익(손실)', 'VIII.반기순이익', '당3분기순이익', '당(분)기순이익', 'VIII.당기순이익', 'Ⅸ. 당기순이익', '당기순손익(손실)', 'XII. 당기순이익', 'XI. 당기순이익(손실)', 'VIII.당기순이익(손실)']

asset_word_list_gaap = ['   자산총계', '   자 산 총 계', '   자산 총계', '   자    산    총    계', '   자  산  총  계', '   자산합계', '   자  산  계']
capital_word_list_gaap = ['   자본총계', '   기말금액', '   당기말', '   반기말자본', '   기말', '   전기말', '   기말 자본', '   자 본 총 계', '   반기말', '   IV. 기말자본', '   당반기말', '   자본 총계', '   당반기말자본', '   반기말 자본', '   자    본    총    계', '   분기말자본', '   자기주식의 취득', '   당기말자본', '   반기자본', '   분기말', '   당분기말', '   당분기말자본', '   분기말 자본', '   당분기말(2019년9월30일)잔액', '   전분기말자본', '   2019.03.31(당분기말)', '   기말잔액', '   기말자본', '   총계', '   (당반기말)', '   당분기말 자본', '   반기순손실', '   반기말잔액', '   3분기말자본', '   2018.9.30(당분기말)', '   분기순손실', '   분기말잔액', '   1분기말자본', '   (당분기말)', '   자본계', '   (당기말)', '   Ⅲ.기말자본', '   IV.당(전)기말', '   자  본  총  계', '   자본합계', '   자  본  계', '   IV.기말자본', '   2017년 9월 30일 (분기말)', '   자본에 직접 반영된 소유주와의 거래', '   2015.12.31(당기말)', '   III.기말자본', '   2015.12.31 기말자본']
liabilities_word_list_gaap = ['   부채총계', '   부 채 총 계', '   부채 총계', '   부    채    총    계', '   부  채  총  계', '   부  채  계']


revenue_code_list = ['ifrs_GrossProfit', 'ifrs-full_GrossProfit']
operating_income_code_list = ['dart_OperatingIncomeLoss',]
profit_loss_code_list = ['ifrs_ProfitLoss', 'ifrs-full_ProfitLoss']

asset_code_list = ['ifrs_Assets', 'ifrs-full_Assets']
capital_code_list = ['ifrs_Equity', 'ifrs-full_Equity']
liabilities_code_list = ['ifrs_Liabilities', 'ifrs-full_Liabilities']


